In [38]:
# data files path: ./data/

In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns
from feature_extractor import *

In [3]:
dataPath = './data/'

In [4]:
users = pd.read_csv(dataPath + "users.csv")
users.head()

,user_id,locale,birthyear,gender,joinedAt,location,timezone
0,3197468391,id_ID,1993,male,2012-10-02T06:40:55.524Z,Medan Indonesia,480.0
1,3537982273,id_ID,1992,male,2012-09-29T18:03:12.111Z,Medan Indonesia,420.0
2,823183725,en_US,1975,male,2012-10-06T03:14:07.149Z,Stratford Ontario,-240.0
3,1872223848,en_US,1991,female,2012-11-04T08:59:43.783Z,Tehran Iran,210.0
4,3429017717,id_ID,1995,female,2012-09-10T16:06:53.132Z,NaN,420.0

In [5]:
# set max display col
# pd.set_option('display.max_colwidth', -1)
# pd.reset_option('display.max_colwidth')
user_friends = pd.read_csv(dataPath + "user_friends.csv")
user_friends.head()

         user                                            friends
0  3197468391  1346449342 3873244116 4226080662 1222907620 54...
1  3537982273  1491560444 395798035 2036380346 899375619 3534...
2   823183725  1484954627 1950387873 1652977611 4185960823 42...
3  1872223848  83361640 723814682 557944478 1724049724 253059...
4  3429017717  4253303705 2130310957 1838389374 3928735761 71...

In [6]:
events = pd.read_csv(dataPath + 'events.csv')
events.head(100)

,event_id,user_id,start_time,city,state,zip,country,lat,lng,c_1,...,c_92,c_93,c_94,c_95,c_96,c_97,c_98,c_99,c_100,c_other
0,684921758,3647864012,2012-10-31T00:00:00.001Z,NaN,NaN,NaN,NaN,NaN,NaN,2,...,0,1,0,0,0,0,0,0,0,9
1,244999119,3476440521,2012-11-03T00:00:00.001Z,NaN,NaN,NaN,NaN,NaN,NaN,2,...,0,0,0,0,0,0,0,0,0,7
2,3928440935,517514445,2012-11-05T00:00:00.001Z,NaN,NaN,NaN,NaN,NaN,NaN,0,...,0,0,0,0,0,0,0,0,0,12
3,2582345152,781585781,2012-10-30T00:00:00.001Z,NaN,NaN,NaN,NaN,NaN,NaN,1,...,0,0,0,0,0,0,0,0,0,8
4,1051165850,1016098580,2012-09-27T00:00:00.001Z,NaN,NaN,NaN,NaN,NaN,NaN,1,...,0,0,0,0,0,0,0,0,0,9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,2860184053,2649231959,2012-11-07T18:00:00.003Z,NaN,NaN,NaN,NaN,NaN,NaN,4,...,0,0,0,0,0,0,0,0,0,106
96,2428635671,2080183227,2012-11-06T00:00:00.001Z,NaN,NaN,NaN,NaN,NaN,NaN,0,...,0,1,0,0,0,0,0,0,0,5
97,2636581520,2597689396,2012-10-26T00:00:00.001Z,NaN,NaN,NaN,NaN,NaN,NaN,1,...,1,0,0,0,0,0,0,0,0,11
98,2305935776,1815300560,2012-10-29T00:00:00.001Z,NaN,NaN,NaN,NaN,NaN,NaN,2,...,0,1,1,0,0,0,0,0,0,8
99,1660818988,3669637287,2012-07-11T02:00:00.000Z,NaN,NaN,NaN,NaN,NaN,NaN,1,...,0,0,0,0,0,0,0,0,0,22

In [7]:
train_data = pd.read_csv(dataPath + 'train.csv')
train_data.head()

,user,event,invited,timestamp,interested,not_interested
0,3044012,1918771225,0,2012-10-02 15:53:05.754000+00:00,0,0
1,3044012,1502284248,0,2012-10-02 15:53:05.754000+00:00,0,0
2,3044012,2529072432,0,2012-10-02 15:53:05.754000+00:00,1,0
3,3044012,3072478280,0,2012-10-02 15:53:05.754000+00:00,0,0
4,3044012,1390707377,0,2012-10-02 15:53:05.754000+00:00,0,0

In [8]:
# gender and dob
# check for nulls
# users['birthyear'].isna().values.any()
# 'None' in users['birthyear'].unique()
# train_data['gender'].unique()

#     return merged_df2

train_data = add_gender_age(train_data, users)
train_data = add_location_features(train_data, events, users)
train_data = add_event_creator_friend_timestamp_feature(train_data, events, user_friends)
train_data.head()

,invited,timestamp,interested,not_interested,event,same_city,same_country,user,event_id,creator_id,start_time,is_creator_friend,not_start_diff
0,0,2012-10-30 01:48:25.617000+00:00,0,0,2352676247,False,False,4236494,2352676247,2939696577,2012-11-04T00:00:00.001Z,False,-425495.0
1,0,2012-10-30 01:48:28.645000+00:00,1,0,152418051,False,True,4236494,152418051,1618377432,2012-11-03T07:00:00.003Z,False,-364292.0
2,0,2012-11-01 08:23:07.912000+00:00,0,0,2352676247,False,False,244644122,2352676247,2939696577,2012-11-04T00:00:00.001Z,False,-229013.0
3,0,2012-11-01 08:23:07.912000+00:00,1,0,152418051,False,True,244644122,152418051,1618377432,2012-11-03T07:00:00.003Z,False,-167813.0
4,0,2012-11-01 08:23:07.912000+00:00,0,0,1859823732,False,False,244644122,1859823732,199568896,2012-11-04T00:00:00.001Z,False,-229013.0